---
kind: method
id: M:Autodesk.Revit.UI.Macros.ApplicationEntryPoint.CreateRibbonPanel(System.String)
source: html/855200bf-24a4-2d34-a716-5b70647d34ae.htm
---
# Autodesk.Revit.UI.Macros.ApplicationEntryPoint.CreateRibbonPanel Method

## Syntax (C#)
```csharp
public override RibbonPanel CreateRibbonPanel(
	string panelName
)
```

## Parameters
- **panelName** (`System.String`)